"""В большой текстовой строке подсчитать количество встречаемых слов и
 вернуть 10 самых частых. Не учитывать знаки препинания и регистр символов.
За основу возьмите любую статью из википедии или из документации к языку."""


import re
from collections import Counter

def top_10_words(text):
    words = re.findall(r'\b\w+\b', text.lower())
    return Counter(words).most_common(10)

text = """По данным на апрель 2022 года русская Википедия заняла третье
 место по посещаемости, уступив английской и японской, и незначительно 
 обошла немецкую и испанскую"""
print(top_10_words(text))